program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.12.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios17>(tensor<fp32, [1, 40, 240]> audio_logmel, tensor<fp32, [1, 7]> scalars, tensor<int32, [1, 96]> text_tokens) {
            tensor<int32, []> var_20_batch_dims_0 = const()[name = tensor<string, []>("op_20_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> var_20_validate_indices_0 = const()[name = tensor<string, []>("op_20_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [443, 128]> embedding_weight_to_fp16 = const()[name = tensor<string, []>("embedding_weight_to_fp16"), val = tensor<fp16, [443, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<string, []> text_tokens_to_int16_dtype_0 = const()[name = tensor<string, []>("text_tokens_to_int16_dtype_0"), val = tensor<string, []>("int16")];
            tensor<string, []> cast_5_dtype_0 = const()[name = tensor<string, []>("cast_5_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, []> greater_equal_0_y_0 = const()[name = tensor<string, []>("greater_equal_0_y_0"), val = tensor<int32, []>(0)];
            tensor<int16, [1, 96]> text_tokens_to_int16 = cast(dtype = text_tokens_to_int16_dtype_0, x = text_tokens)[name = tensor<string, []>("cast_10")];
            tensor<int32, [1, 96]> cast_5 = cast(dtype = cast_5_dtype_0, x = text_tokens_to_int16)[name = tensor<string, []>("cast_9")];
            tensor<bool, [1, 96]> greater_equal_0 = greater_equal(x = cast_5, y = greater_equal_0_y_0)[name = tensor<string, []>("greater_equal_0")];
            tensor<int32, []> slice_by_index_1 = const()[name = tensor<string, []>("slice_by_index_1"), val = tensor<int32, []>(443)];
            tensor<int32, [1, 96]> add_0 = add(x = cast_5, y = slice_by_index_1)[name = tensor<string, []>("add_0")];
            tensor<int32, [1, 96]> select_0 = select(a = cast_5, b = add_0, cond = greater_equal_0)[name = tensor<string, []>("select_0")];
            tensor<int32, []> var_20_cast_fp16_cast_uint16_axis_0 = const()[name = tensor<string, []>("op_20_cast_fp16_cast_uint16_axis_0"), val = tensor<int32, []>(0)];
            tensor<string, []> select_0_to_int16_dtype_0 = const()[name = tensor<string, []>("select_0_to_int16_dtype_0"), val = tensor<string, []>("int16")];
            tensor<int16, [1, 96]> select_0_to_int16 = cast(dtype = select_0_to_int16_dtype_0, x = select_0)[name = tensor<string, []>("cast_8")];
            tensor<fp16, [1, 96, 128]> var_20_cast_fp16_cast_uint16_cast_uint16 = gather(axis = var_20_cast_fp16_cast_uint16_axis_0, batch_dims = var_20_batch_dims_0, indices = select_0_to_int16, validate_indices = var_20_validate_indices_0, x = embedding_weight_to_fp16)[name = tensor<string, []>("op_20_cast_fp16_cast_uint16_cast_uint16")];
            tensor<int32, [3]> input_3_perm_0 = const()[name = tensor<string, []>("input_3_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_5_strides_0 = const()[name = tensor<string, []>("input_5_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_5_dilations_0 = const()[name = tensor<string, []>("input_5_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_5_groups_0 = const()[name = tensor<string, []>("input_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [192, 128, 3]> text_encoder_0_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_0_weight_to_fp16"), val = tensor<fp16, [192, 128, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113536)))];
            tensor<fp16, [192]> text_encoder_0_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_0_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(261056)))];
            tensor<fp16, [1, 128, 96]> input_3_cast_fp16 = transpose(perm = input_3_perm_0, x = var_20_cast_fp16_cast_uint16_cast_uint16)[name = tensor<string, []>("transpose_0")];
            tensor<fp16, [1, 192, 96]> input_5_cast_fp16 = conv(bias = text_encoder_0_bias_to_fp16, dilations = input_5_dilations_0, groups = input_5_groups_0, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = input_5_strides_0, weight = text_encoder_0_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> input_7_mode_0 = const()[name = tensor<string, []>("input_7_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 192, 96]> input_7_cast_fp16 = gelu(mode = input_7_mode_0, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [192, 192, 3]> text_encoder_2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_2_weight_to_fp16"), val = tensor<fp16, [192, 192, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(261504)))];
            tensor<fp16, [192]> text_encoder_2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_2_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(482752)))];
            tensor<fp16, [1, 192, 96]> input_9_cast_fp16 = conv(bias = text_encoder_2_bias_to_fp16, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = text_encoder_2_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_mode_0 = const()[name = tensor<string, []>("input_11_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 192, 96]> input_11_cast_fp16 = gelu(mode = input_11_mode_0, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [1]> reduce_max_0_axes_0 = const()[name = tensor<string, []>("reduce_max_0_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<bool, []> reduce_max_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_max_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 192, 1]> reduce_max_0_cast_fp16 = reduce_max(axes = reduce_max_0_axes_0, keep_dims = reduce_max_0_keep_dims_0, x = input_11_cast_fp16)[name = tensor<string, []>("reduce_max_0_cast_fp16")];
            tensor<int32, []> concat_0_axis_0 = const()[name = tensor<string, []>("concat_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<bool, []> concat_0_interleave_0 = const()[name = tensor<string, []>("concat_0_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192, 1]> concat_0_cast_fp16 = concat(axis = concat_0_axis_0, interleave = concat_0_interleave_0, values = reduce_max_0_cast_fp16)[name = tensor<string, []>("concat_0_cast_fp16")];
            tensor<int32, [1]> text_features_axes_0 = const()[name = tensor<string, []>("text_features_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 192]> text_features_cast_fp16 = squeeze(axes = text_features_axes_0, x = concat_0_cast_fp16)[name = tensor<string, []>("text_features_cast_fp16")];
            tensor<int32, [1]> var_61_axes_0 = const()[name = tensor<string, []>("op_61_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<bool, []> var_61_keep_dims_0 = const()[name = tensor<string, []>("op_61_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<string, []> audio_logmel_to_fp16_dtype_0 = const()[name = tensor<string, []>("audio_logmel_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 40, 240]> audio_logmel_to_fp16 = cast(dtype = audio_logmel_to_fp16_dtype_0, x = audio_logmel)[name = tensor<string, []>("cast_7")];
            tensor<fp16, [1, 40]> var_61_cast_fp16 = reduce_mean(axes = var_61_axes_0, keep_dims = var_61_keep_dims_0, x = audio_logmel_to_fp16)[name = tensor<string, []>("op_61_cast_fp16")];
            tensor<bool, []> var_64 = const()[name = tensor<string, []>("op_64"), val = tensor<bool, []>(false)];
            tensor<int32, [1]> var_65_axes_0 = const()[name = tensor<string, []>("op_65_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 40]> var_65_cast_fp16 = reduce_max(axes = var_65_axes_0, keep_dims = var_64, x = audio_logmel_to_fp16)[name = tensor<string, []>("op_65_cast_fp16")];
            tensor<bool, []> var_68 = const()[name = tensor<string, []>("op_68"), val = tensor<bool, []>(false)];
            tensor<int32, [1]> var_69_axes_0 = const()[name = tensor<string, []>("op_69_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 40]> var_69_cast_fp16 = reduce_min(axes = var_69_axes_0, keep_dims = var_68, x = audio_logmel_to_fp16)[name = tensor<string, []>("op_69_cast_fp16")];
            tensor<int32, []> var_71 = const()[name = tensor<string, []>("op_71"), val = tensor<int32, []>(1)];
            tensor<bool, []> input_13_interleave_0 = const()[name = tensor<string, []>("input_13_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 120]> input_13_cast_fp16 = concat(axis = var_71, interleave = input_13_interleave_0, values = (var_61_cast_fp16, var_65_cast_fp16, var_69_cast_fp16))[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [128, 120]> audio_encoder_0_weight_to_fp16 = const()[name = tensor<string, []>("audio_encoder_0_weight_to_fp16"), val = tensor<fp16, [128, 120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(483200)))];
            tensor<fp16, [128]> audio_encoder_0_bias_to_fp16 = const()[name = tensor<string, []>("audio_encoder_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(513984)))];
            tensor<fp16, [1, 128]> linear_0_cast_fp16 = linear(bias = audio_encoder_0_bias_to_fp16, weight = audio_encoder_0_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<int32, [1]> input_17_axes_0 = const()[name = tensor<string, []>("input_17_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [128]> audio_encoder_1_weight_to_fp16 = const()[name = tensor<string, []>("audio_encoder_1_weight_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(514304)))];
            tensor<fp16, [128]> audio_encoder_1_bias_to_fp16 = const()[name = tensor<string, []>("audio_encoder_1_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(514624)))];
            tensor<fp16, []> var_75_to_fp16 = const()[name = tensor<string, []>("op_75_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 128]> input_17_cast_fp16 = layer_norm(axes = input_17_axes_0, beta = audio_encoder_1_bias_to_fp16, epsilon = var_75_to_fp16, gamma = audio_encoder_1_weight_to_fp16, x = linear_0_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<string, []> input_19_mode_0 = const()[name = tensor<string, []>("input_19_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128]> input_19_cast_fp16 = gelu(mode = input_19_mode_0, x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<fp16, [96, 128]> audio_encoder_3_weight_to_fp16 = const()[name = tensor<string, []>("audio_encoder_3_weight_to_fp16"), val = tensor<fp16, [96, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(514944)))];
            tensor<fp16, [96]> audio_encoder_3_bias_to_fp16 = const()[name = tensor<string, []>("audio_encoder_3_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(539584)))];
            tensor<fp16, [1, 96]> linear_1_cast_fp16 = linear(bias = audio_encoder_3_bias_to_fp16, weight = audio_encoder_3_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<string, []> audio_features_mode_0 = const()[name = tensor<string, []>("audio_features_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 96]> audio_features_cast_fp16 = gelu(mode = audio_features_mode_0, x = linear_1_cast_fp16)[name = tensor<string, []>("audio_features_cast_fp16")];
            tensor<int32, []> var_98 = const()[name = tensor<string, []>("op_98"), val = tensor<int32, []>(1)];
            tensor<bool, []> input_23_interleave_0 = const()[name = tensor<string, []>("input_23_interleave_0"), val = tensor<bool, []>(false)];
            tensor<string, []> scalars_to_fp16_dtype_0 = const()[name = tensor<string, []>("scalars_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 7]> scalars_to_fp16 = cast(dtype = scalars_to_fp16_dtype_0, x = scalars)[name = tensor<string, []>("cast_6")];
            tensor<fp16, [1, 295]> input_23_cast_fp16 = concat(axis = var_98, interleave = input_23_interleave_0, values = (text_features_cast_fp16, audio_features_cast_fp16, scalars_to_fp16))[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [192, 295]> fusion_0_weight_to_fp16 = const()[name = tensor<string, []>("fusion_0_weight_to_fp16"), val = tensor<fp16, [192, 295]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(539840)))];
            tensor<fp16, [192]> fusion_0_bias_to_fp16 = const()[name = tensor<string, []>("fusion_0_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(653184)))];
            tensor<fp16, [1, 192]> linear_2_cast_fp16 = linear(bias = fusion_0_bias_to_fp16, weight = fusion_0_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [1]> input_27_axes_0 = const()[name = tensor<string, []>("input_27_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [192]> fusion_1_weight_to_fp16 = const()[name = tensor<string, []>("fusion_1_weight_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(653632)))];
            tensor<fp16, [192]> fusion_1_bias_to_fp16 = const()[name = tensor<string, []>("fusion_1_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(654080)))];
            tensor<fp16, []> var_104_to_fp16 = const()[name = tensor<string, []>("op_104_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 192]> input_27_cast_fp16 = layer_norm(axes = input_27_axes_0, beta = fusion_1_bias_to_fp16, epsilon = var_104_to_fp16, gamma = fusion_1_weight_to_fp16, x = linear_2_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<string, []> input_29_mode_0 = const()[name = tensor<string, []>("input_29_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 192]> input_29_cast_fp16 = gelu(mode = input_29_mode_0, x = input_27_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, [192, 192]> fusion_4_weight_to_fp16 = const()[name = tensor<string, []>("fusion_4_weight_to_fp16"), val = tensor<fp16, [192, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(654528)))];
            tensor<fp16, [192]> fusion_4_bias_to_fp16 = const()[name = tensor<string, []>("fusion_4_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(728320)))];
            tensor<fp16, [1, 192]> linear_3_cast_fp16 = linear(bias = fusion_4_bias_to_fp16, weight = fusion_4_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<string, []> input_mode_0 = const()[name = tensor<string, []>("input_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 192]> input_cast_fp16 = gelu(mode = input_mode_0, x = linear_3_cast_fp16)[name = tensor<string, []>("input_cast_fp16")];
            tensor<fp16, [1, 192]> response_head_weight_to_fp16 = const()[name = tensor<string, []>("response_head_weight_to_fp16"), val = tensor<fp16, [1, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(728768)))];
            tensor<fp16, [1]> response_head_bias_to_fp16 = const()[name = tensor<string, []>("response_head_bias_to_fp16"), val = tensor<fp16, [1]>([-0x1.d04p-5])];
            tensor<fp16, [1, 1]> linear_4_cast_fp16 = linear(bias = response_head_bias_to_fp16, weight = response_head_weight_to_fp16, x = input_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<int32, [1]> var_126_axes_0 = const()[name = tensor<string, []>("op_126_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1]> response_logit = squeeze(axes = var_126_axes_0, x = linear_4_cast_fp16)[name = tensor<string, []>("op_126_cast_fp16")];
            tensor<fp16, [18, 192]> label_head_weight_to_fp16 = const()[name = tensor<string, []>("label_head_weight_to_fp16"), val = tensor<fp16, [18, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(729216)))];
            tensor<fp16, [18]> label_head_bias_to_fp16 = const()[name = tensor<string, []>("label_head_bias_to_fp16"), val = tensor<fp16, [18]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(736192)))];
            tensor<fp16, [1, 18]> label_logits = linear(bias = label_head_bias_to_fp16, weight = label_head_weight_to_fp16, x = input_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [1, 192]> complete_head_weight_to_fp16 = const()[name = tensor<string, []>("complete_head_weight_to_fp16"), val = tensor<fp16, [1, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(736320)))];
            tensor<fp16, [1]> complete_head_bias_to_fp16 = const()[name = tensor<string, []>("complete_head_bias_to_fp16"), val = tensor<fp16, [1]>([0x1.7a4p-4])];
            tensor<fp16, [1, 1]> linear_6_cast_fp16 = linear(bias = complete_head_bias_to_fp16, weight = complete_head_weight_to_fp16, x = input_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<int32, [1]> var_134_axes_0 = const()[name = tensor<string, []>("op_134_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1]> complete_logit = squeeze(axes = var_134_axes_0, x = linear_6_cast_fp16)[name = tensor<string, []>("op_134_cast_fp16")];
            tensor<fp16, [1, 192]> rhetorical_head_weight_to_fp16 = const()[name = tensor<string, []>("rhetorical_head_weight_to_fp16"), val = tensor<fp16, [1, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(736768)))];
            tensor<fp16, [1]> rhetorical_head_bias_to_fp16 = const()[name = tensor<string, []>("rhetorical_head_bias_to_fp16"), val = tensor<fp16, [1]>([-0x1.72cp-9])];
            tensor<fp16, [1, 1]> linear_7_cast_fp16 = linear(bias = rhetorical_head_bias_to_fp16, weight = rhetorical_head_weight_to_fp16, x = input_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<int32, [1]> var_139_axes_0 = const()[name = tensor<string, []>("op_139_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1]> rhetorical_logit = squeeze(axes = var_139_axes_0, x = linear_7_cast_fp16)[name = tensor<string, []>("op_139_cast_fp16")];
        } -> (response_logit, label_logits, complete_logit, rhetorical_logit);
}